Ends of the sketched loop do not lie on the boundary of the face being modified.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId EndsNotOnCutFace { get; }
  Visual Basic
Public Shared ReadOnly Property EndsNotOnCutFace As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ EndsNotOnCutFace {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace